<a href="https://colab.research.google.com/github/akashth11/akashth11.github.io/blob/master/q1_testing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [299]:
import pandas as pd
from pandas.api.types import is_datetime64_any_dtype as is_datetime
import numpy as np

In [358]:
d = {'Name': ['akash', 'abhishek','prateek'],'start_date': ['2017-02-01', '2017/02/01','2017/02/05'],'LName': ['Thakur', 'singh','srivastava'], 'end_date': ['2017-02-01','2017-02-01','2017-02-01'],'extra_date': ['2018-02-01', '2019/02/01','2017/02/05'],'ek_or_date': ['2016-02-01','2020-04-01','2012-08-07']}

In [359]:
df = pd.DataFrame(data=d)

In [360]:
df

       Name  start_date       LName    end_date  extra_date  ek_or_date
0     akash  2017-02-01      Thakur  2017-02-01  2018-02-01  2016-02-01
1  abhishek  2017/02/01       singh  2017-02-01  2019/02/01  2020-04-01
2   prateek  2017/02/05  srivastava  2017-02-01  2017/02/05  2012-08-07

In [361]:
df.select_dtypes(include=[np.datetime64])

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [362]:

df.dtypes

Name          object
start_date    object
LName         object
end_date      object
extra_date    object
ek_or_date    object
dtype: object

In [363]:
df['start_date'] = pd.to_datetime(df['start_date'])

In [364]:
df

       Name start_date       LName    end_date  extra_date  ek_or_date
0     akash 2017-02-01      Thakur  2017-02-01  2018-02-01  2016-02-01
1  abhishek 2017-02-01       singh  2017-02-01  2019/02/01  2020-04-01
2   prateek 2017-02-05  srivastava  2017-02-01  2017/02/05  2012-08-07

In [365]:
df.dtypes

Name                  object
start_date    datetime64[ns]
LName                 object
end_date              object
extra_date            object
ek_or_date            object
dtype: object

In [366]:
for col in df.columns:
    if df[col].dtype == 'object':
        try:
            df[col] = pd.to_datetime(df[col])
        except ValueError:
            pass

In [367]:
df.dtypes

Name                  object
start_date    datetime64[ns]
LName                 object
end_date      datetime64[ns]
extra_date    datetime64[ns]
ek_or_date    datetime64[ns]
dtype: object

In [368]:
print(df)

       Name start_date       LName   end_date extra_date ek_or_date
0     akash 2017-02-01      Thakur 2017-02-01 2018-02-01 2016-02-01
1  abhishek 2017-02-01       singh 2017-02-01 2019-02-01 2020-04-01
2   prateek 2017-02-05  srivastava 2017-02-01 2017-02-05 2012-08-07

In [369]:
dfdate=pd.DataFrame(data=df.select_dtypes('datetime64'))

In [370]:
dfdate

  start_date   end_date extra_date ek_or_date
0 2017-02-01 2017-02-01 2018-02-01 2016-02-01
1 2017-02-01 2017-02-01 2019-02-01 2020-04-01
2 2017-02-05 2017-02-01 2017-02-05 2012-08-07

In [371]:
n=len(dfdate.columns)-1

In [372]:
i=0

In [373]:
print(n)

3

In [374]:
dfdate. iloc[:, i]-dfdate. iloc[:, i+1]

0   0 days
1   0 days
2   4 days
dtype: timedelta64[ns]

In [375]:
subdate = pd.DataFrame()

In [376]:
while(i<n):
  add_data=dfdate. iloc[:, i]-dfdate. iloc[:, i+1]
  subdate.insert(i,i+1,add_data)
  i+=1

In [377]:
subdate

       1         2         3
0 0 days -365 days  731 days
1 0 days -730 days -425 days
2 4 days   -4 days 1643 days

In [378]:
print(subdate.add_prefix('Date ').add_suffix(' Subtraction'))

  Date 1 Subtraction Date 2 Subtraction Date 3 Subtraction
0             0 days          -365 days           731 days
1             0 days          -730 days          -425 days
2             4 days            -4 days          1643 days